Revit 2027 API
DatumPlane.IsCurveValidInView Method
 Checks if the curve is valid to be as the extents for the datum plane in a view. The curve must be bound and coincident with the original one of the datum plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCurveValidInView(
	DatumExtentType extentMode,
	View view,
	Curve curve
)
Public Function IsCurveValidInView (
	extentMode As DatumExtentType,
	view As View,
	curve As Curve
) As Boolean
public:
bool IsCurveValidInView(
	DatumExtentType extentMode,
	View^ view,
	Curve^ curve
)
member IsCurveValidInView :
        extentMode : DatumExtentType *
        view : View *
        curve : Curve -> bool
Parameters
extentMode DatumExtentType
 The extent type.
view View
 The view.
curve Curve
 The curve.
Return Value
Boolean
 True if it is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DatumPlane Class
Autodesk.Revit.DB Namespace